Revit 2024 API
BuiltInFailures.GeneralFailures Class
 Failures about GeneralFailures.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class GeneralFailures
Visual Basic
Public NotInheritable Class GeneralFailures
Visual C++
public ref class GeneralFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.GeneralFailures
See Also
BuiltInFailures.GeneralFailures Members
Autodesk.Revit.DB Namespace